Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Could you get a hammer for me from the kitchen please?
hi: रसोई में जाकर मेरे लिए एक हथौड़ा ले आओगे क्या?

source: She is poor, but happy.
hi: वह गरीब है, पर खुश है।

source: He is poor, but happy.
hi: वह गरीब है, पर खुश है।

source: Are there enough chairs?
hi: कुरसियाँ काफ़ी हैं क्या?

source: China is much bigger than Japan.
hi: चीन जापान से काफ़ी ज़्यादा बड़ा है।

source: No matter what happens, I will never betray my friend.
hi: चाहे जो भी हो, मैं कभी भी अपने दोस्त को धोखा नहीं दूँगा।

source: Holland is a small country.
hi: हॉलैंड छोटा देश है।

source: Cheers!
hi: वाह-वाह!

source: I worked on the farm all day.
hi: मैंने पूरे दिन खेत में काम किया।

source: When did you get married?
hi: तुम्हारी शादी कब हुई थी?

source: He likes his school a lot.
hi: उसे अपना स्कूल बहुत पसंद है।

source: She likes her school a lot.
hi: उसे अपना स्कूल बहुत पसंद है।

source: Who's to blame for the accident?
hi: इस दुर्घटना के लिए कौन ज़िम्मेदार है?

source: He does not believe in any faith.
hi: वह किसी भी धर्म को नहीं मानता है।

source: Everyone could easily see his disappointment.
hi: उसकी निराशा सभी आसानी से दिख सकते थे।

source: My mother told me to do a careless job of it.
hi: मेरी माँ ने मुझसे घास काटने के लिए कहा।

source: School is over at 3:30.
hi: स्कूल साढ़े तीन बजे छूटता है।

source: I refuse to talk to you!
hi: मैं तुमसे नहीं बोलती!

source: Who's the author of this story?
hi: इस कहानी का लेखक कौन है?

source: The Bhopal Gas Tragedy, which occurred on the night of December 2, 1984 at the Union Carbide plant in Bhopal, India, is the world's worst industrial catastrophe.
hi: भोपाल गैस त्रासदी, जो भारत के भोपाल शहर के यूनियन कार्बाइड कारखाने में दिसम्बर २, १९८४ की रात को हुई, दुनिया की सबसे विपत्तिजनक औद्योगिक दुर्घटना है।

source: Thousands of people lost their lives in the Bhopal Gas Tragedy, and even today hundreds of thousands of people still suffer from the ill-effects of the poisonous gas.
hi: भोपाल गैस त्रासदी में हज़ारों लोग मारे गए और आज भी लाखों लोग उस जहरीली गैस के दुर्प्रभावों से पीड़ित हैं।

source: We will have to take off our shoes before going in.
hi: हमे अंदर जाने से पहले जूते उतारने होंगे।

source: The Taj Mahal is a mausoleum located in Agra, India.
hi: ताज महल भारत के आगरा शहर में स्थित एक मक़बरा है।

source: The Taj Mahal is one of the seven wonders of the world.
hi: ताज महल विश्व के सात आश्चर्यों में से एक है।

source: The capital of India is New Delhi.
hi: भारत की राजधानी नई दिल्ली है।

source: New Delhi is the capital of India.
hi: भारत की राजधानी नई दिल्ली है।

source: India is a union of twenty-eight states and seven union territories.
hi: भारत अट्ठाईस राज्यों और सात केन्द्र शासित प्रदेशों का एक संघ है।

source: Mumbai is the capital of the Indian state of Maharashtra.
hi: मुम्बई भारतीय राज्य महाराष्ट्र की राजधानी है।

source: Mumbai is the most populous city in India and the second most populous city in the world.
hi: मुम्बई भारत की पहली और दुनिया की दूसरी सर्वाधिक आबादी वाली नगरी है।

source: Bombay is the former name of Mumbai and was given to it by the English.
hi: बमबई मुम्बई का पुराना नाम है जो उसे अंग्रेज़ों ने दिया था।

source: The Qutub Minar and Red Fort are in Delhi.
hi: क़ुतुब मीनार और लाल किला दिल्ली में हैं।

source: We don't have time to finish the job properly; we're just going to have to wing it.
hi: हमारे पास ठीक से काम खतम करने के लिए समय नहीं हैं, कोई-न-कोई जुगाड़ लगाना होगा।

source: What the fuck do you think you're doing?
hi: साले, तू क्या कर रहा है?

source: Have you gone nuts?
hi: तेरी अकल घास चरने गई है क्या?

source: Swimming is easy for me.
hi: मेरे लिए तैरना आसान है।

source: I am married.
hi: मैं शादीशुदा हूं।

source: The capital of Himachal Pradesh, Shimla, is only 115 kilometres away from Chandigarh.
hi: हिमाचल प्रदेश की राजधानी, शिमला, चण्डीगढ़ से केवल ११५ किलोमीटर की दूरी पर है।

source: Bulla, who knows who I am!
hi: बुल्ला, की जाणा मैं कौण!

source: This is not your book, it's mine.
hi: यह तुम्हारी किताब नहीं है, यह मेरी है।

source: The ship leaves for Honolulu tomorrow.
hi: वह जहाज़ कल होनोलूलू के लिए रवाना होगा।

source: You're driving like a maniac!
hi: आप किसी सनकी की तरह गाड़ी चला रहे हैं!

source: I'm a translator.
hi: मैं अनुवादक हूँ।

source: We drink our tea with sugar.
hi: हम चाय चीनी के साथ लेते हैं।

source: We put sugar in our tea.
hi: हम चाय में चीनी डालते हैं।

source: We take our tea with sugar.
hi: हम चाय चीनी के साथ लेते हैं।

source: A neutral country is a country that doesn't sell weapons to a warring country, unless you pay cash.
hi: तटस्थ देश वह देश होता है जो किसी युद्धरत देश को हत्यार नहीं बेचता, सिवाय अगर आप नकद में भुगतान कर रहे हैं।

source: Whatever!
hi: जो भी हो!

source: I hate taking risks.
hi: मुझे जोखिम लेना पसंद नहीं है।

source: Stuff happens.
hi: कुछ कुछ होता है।

source: It is free of charge.
hi: यह मुफ़्त का है।

source: It was proved that he was a thief.
hi: यह साबित कर दिया गया कि वह चोर था।

source: What is the name of this bird?
hi: इस चिड़िया का नाम क्या है?

source: This cloth is really smooth and silky.
hi: यह कपड़ा बहुत रेशमी है।

source: How long did it take you to translate this book?
hi: तुम्हे इस किताब का अनुवाद करने में कितना समय लगा?

source: The dog is mine.
hi: कुत्ता मेरा है।

source: The girl who works at the bakery is cute.
hi: बेकरी में जो लड़की काम करती है वह बहुत क्यूट है।

source: These pictures are really very beautiful.
hi: ये तस्वीरें सच में बहुत सुंदर हैं।

source: This is why I came back.
hi: मैं इसीलिए वापस आया था।

source: He's English, but lives in India.
hi: वह अंग्रेज़ है, मगर भारत में रहता है।

source: I have a hard-on for her.
hi: मेरा लुंड उसके लिए खड़ा है।

source: This book is about China.
hi: यह पुस्तक चीन के बारे में है।

source: Please shut the door.
hi: दरवाज़े को बंद कर दीजिए।

source: Please close the door.
hi: दरवाज़े को बंद कर दीजिए।

source: All men are equal according to law.
hi: क़ानून के मुताबिक सभी मनुष्य समान हैं।

source: Who cut your hair?
hi: तुम्हारे बाल किसने काटें?

source: I count to ten.
hi: मैं दस तक गिनता हूं।

source: He is engaged to my sister.
hi: उसकी मेरी बहन के साथ सगाई हो चुकी है।

source: If it snows tomorrow, I'll build a snowman.
hi: अगर कल बर्फ़ गिरी तो मैं स्नोमैन बनाऊंगा।

source: Read as many books as possible.
hi: जितनी किताबें पढ़ सकते हो पढ़ो।

source: What did you say? Dead?
hi: तुमने क्या कहा? मर गया?

source: One should always give something to beggars.
hi: भिखारियों को हमेशा कुछ देना चाहिए।

source: There is a limit to how much one can tolerate.
hi: बर्दाश्त की भी हद होती है।

source: Nice to meet you.
hi: आपसे मिलकर खुशी हुई।

source: Really, you are very good.
hi: तुम सच में बहुत ही अच्छे हो।

source: She prattles on and on.
hi: वह बहुत बक-बक करती है।

source: I can drive a car.
hi: मैं गाड़ी चला सकता हूँ।

source: Complete that which you can today. Don't leave it till tomorrow.
hi: जो आज खतम कर सकते हो, उसे करके निपटाओ। कल के लिए मत छोड़ो।

source: What'll you be doing at this time tomorrow?
hi: तुम कल इस समय क्या कर रहे होगे?

source: He won the race once again.
hi: उसने दौड़ फिरसे जीत ली।

source: China is bigger than Japan.
hi: चीन जापान से बड़ा है।

source: I don't believe in God.
hi: मैं भगवान में यकीन नहीं करता।

source: My eyes are tired.
hi: मेरी आँखें थक गईं हैं।

source: I've been studying Uighur for two years now.
hi: मैं अभी दो सालों से उइघुर भाषा सीख रहा हूं।

source: Where's the bank?
hi: बैंक कहाँ है?

source: He has written two books.
hi: उसने दो किताबें लिखी हैं।

source: We can deliver within a week.
hi: हम एक हफ़्ते के अंदर-अंदर पहुँचा सकते हैं।

source: You should've come yesterday.
hi: तुम्हे कल आना चाहिए था।

source: Let's eat before we go.
hi: जाने से पहले खा लेते हैं।

source: My name is Farshad.
hi: मेरा नाम फ़रशाद है।

source: He became a police officer.
hi: वह पुलिस अफ़सर बन गया।

source: He doesn't know how to swim.
hi: उसको तैरना नहीं आता।

source: English is my native language.
hi: अंग्रेज़ी मेरी मातृ भाषा है।

source: English is my mother tongue.
hi: अंग्रेज़ी मेरी मातृ भाषा है।

source: Spain is the winner of the 2010 FIFA World Cup.
hi: २०१० फ़िफ़ा विश्व कप का विजेता स्पेन था।

source: Come on! I will show you the taste of defeat.
hi: आओ! मैं तुम्हें हार का स्वाद चखाऊँगा।

source: There were a lot of men among the inhabitants.
hi: वस्नीकों में काफी तादाद में मर्द थे.

source: Attention!
hi: सावधान!

source: Do you know how to use a computer?
hi: क्या आपको कम्प्यूटर का इस्तेमाल करना आता है?

source: Long live the Persian language!
hi: फ़ारसी ज़ुबान ज़िंदाबाद!

source: Monsoon is coming.
hi: सावन का मौसम आ रहा है।

source: The monsoon season is coming.
hi: सावन का मौसम आ रहा है।

source: You play Starcraft really well.
hi: तुम स्टारक्राफ़्ट बड़ी अच्छी तरह से खेलते हो।

source: His little sister is fuckable.
hi: उसकी छोटी बहन चोदने लायक है।

source: Please leave.
hi: कृपया जाईये।

source: This book is mine.
hi: यह किताब मेरी है।

source: We're good friends.
hi: हम अच्छे दोस्त हैं।

source: I sank into unconsciousness.
hi: मैं बेहोशी में चला गया।

source: No, I didn't go.
hi: नहीं, मैं नहीं गया था।

source: Goodbye!
hi: ख़ुदा हाफ़िज़।

source: We are responsible for your protection from now on.
hi: अबसे आपकी हिफ़ाज़त के लिए हम ज़िम्मेदार हैं।

source: I'm dying of exhaustion.
hi: मैं थकान से मरा जा रहा हूँ।

source: He stood up.
hi: वह खड़ा हो गया।

source: The ticket for your return journey has been arranged for.
hi: आपके लौटने की टिकट का बंदोबस्त हो गया है।

source: Look, there's a cat in the kitchen.
hi: देखो, रसोई में बिल्ली है।

source: You may go.
hi: चाहो तो तुम जा सकती हो।

source: She always wears black.
hi: वह हमेशा काले कपड़े पहनती है।

source: Have you ever seen a koala?
hi: तुमने कभी क्वाला देखा है?

source: I've known Jim since I was a child.
hi: मैं जिम को बचपन से जानता हूँ।

source: I had a fight with my older brother yesterday.
hi: मेरा कल मेरे भाई के साथ झगड़ा हुआ था।

source: She is eating.
hi: वह खा रही है।

source: He's blond.
hi: उसके सुनहरे बाल है।

source: Yesterday was Thursday.
hi: कल गुरुवार था।

source: He climbed the stairs.
hi: वह सीड़ियों पर चढ़ गया।

source: China's developing too quickly.
hi: चीन कुछ ज़्यादा ही तेज़ी से विकसित हो रहा है।

source: The keys are on the table.
hi: चाबियाँ मेज़ पर हैं।

source: You will get fat if you eat too much.
hi: बहुत ज़्यादा खा लिया तो मोटे हो जाओगे।

source: But I don't think that it's strange at all.
hi: पर मेरे खयाल से यह बिलकुल भी अजीब नहीं है।

source: Who likes insects?
hi: कीड़ें किसे पसंद है?

source: I am a translator.
hi: मैं अनुवादक हूँ।

source: I speak English, Russian and Globish.
hi: मैं अंग्रेज़ी, रूसी और ग्लोबिश बोलता हूँ।

source: Crap! I fell for his trap!
hi: अरे! मैं उसके चंगुल में फंस गया!

source: I'm neither an Athenian nor a Greek.
hi: मैं ना एथेनियाई हूँ ना यूनानी।

source: This is a Turkish tradition.
hi: यह एक तुर्की परंपरा है।

source: I'm a vegetarian who eats a ton of meat.
hi: मैं बहुत सारा मांस खाने वाला शाकाहारी हूँ।

source: I don't like bad children.
hi: मुझे बुरे बच्चे पसंद नहीं हैं।

source: I can't remember.
hi: मुझे याद नहीं।

source: No problem.
hi: कोई बात नहीं।

source: My name is Ahmad.
hi: मेरा नाम अहमद है।

source: He's my friend.
hi: वह मेरा दोस्त है।

source: They speak English in Australia.
hi: ऑस्ट्रेलिया में अंग्रेजी बोलते हैं।

source: The clock is slow.
hi: यह घड़ी धीरे चलती है।

source: The Swiss keyboard doesn't have a ß.
hi: स्वीस कीबोर्ड पर ß नहीं होता।

source: Italian is my mother tongue.
hi: इतालवी मेरी मातृभाषा है।

source: I wonder what I should get you for your birthday.
hi: मैं सोच रही हूँ तुम्हारे जन्मदिव्स पर तुम्हे क्या उपहार दूँ।

source: I want to visit Korea.
hi: मैं कोरिया जाना चाहता हूँ।

source: There's the island of my dreams!
hi: वह रहा मेरे सपनों का द्वीप!

source: Now that we've bought new furniture for the room, why not throw away this old, worn-out furniture?
hi: अब ज्योंकि कमरे का नया फ़र्निचर खरिद चुका है, इस फटे-पुराने फ़र्निचर को क्यों न फेंक दें!

source: Kublai Khan is the grandson of Genghis Khan.
hi: कुबलई ख़ान चंगेज़ ख़ान के पोते हैं।

source: My name is Sasha.
hi: मेरा नाम साशा है।

source: Long live the Republic!
hi: गणतन्त्र ज़िंदाबाद!

source: You like to sing?
hi: तुम्हे गाना गाना पसंद है?

source: My father bought me a bicycle.
hi: मेरे पिताजी ने मेरे लिए साइकिल खरीदी।

source: Russians never smile.
hi: रूसी कभी मुस्कुराते नहीं।

source: Shishir is following me.
hi: शिशिर मेरा पीछा कर रहा है।

source: My name is Wang Jiaming.
hi: मेरा नाम वांग जियामिंग है।

source: Fix the clock.
hi: घड़ी ठीक करो।

source: As long as there is life, there is hope.
hi: जब तक जान है, आशा है।

source: There are more clouds today than yesterday.
hi: आज बादल कल से ज़्यादा हैं।

source: History is the teacher of life.
hi: इतिहास ज़िन्दगी का अध्यापक है.

source: After death there is nothing.
hi: मृत्यु के बाद कुछ नहीं होता।

source: We must clean our classroom.
hi: हमें हमारा कक्षागृह साफ़ करना चाहिए।

source: Hey.
hi: हे.

source: She's a very good teacher.
hi: वह बहुत अच्छी अध्यापिका है.

source: I don't like eggs.
hi: मुझे अंडे पसंद नहीं है।

source: Dogs are faithful.
hi: कुत्ते वफ़ादार होते हैं।

source: Do you like baseball?
hi: क्या तुम्हें बेसबॉल पसंद है?

source: The abbot gave rice to the vixen.
hi: मठाधीश ने लोमड़ी को चावल दिया।

source: Australian women are very beautiful.
hi: ऑस्ट्रेलियाई औरतें बहुत सुंदर होती हैं।

source: Where is my dad?
hi: मेरे पापा कहाँ हैं?

source: Where were you yesterday?
hi: कल तुम कहाँ थे?

source: I categorically refused.
hi: मैंने सरासर इनकार कर दिया।

source: How fast is that train going?
hi: वह ट्रेन कितनी तेज़ जा रही है?

source: I love pizza very much.
hi: मुझे पिज़्ज़ा बहुत पसंद है।

source: Your house is big.
hi: तुम्हारा घर बड़ा है।

source: Allah is the greatest!
hi: अल्लाह सबसे महान है!

source: I'm with you.
hi: मैं तुम्हारे साथ हूं।

source: I can't talk.
hi: मैं बात नहीं कर सकता।

source: I apologize.
hi: मैं माफ़ी माँगता हूँ।

source: What do you want to do today?
hi: आज तुम क्या करना चाहते हो?

source: We want complete sentences.
hi: हमें केवल सम्पूर्ण वाक्य चाहिएं।

source: Don't change sentences that are correct. You can, instead, submit natural-sounding alternative translations.
hi: अगर कोई वाक्य सही है, उसे मत बदलिए। उसके बजाय, आप दूसरा ज़्यादा स्वाभाविक अनुवाद जोड़ सकते हैं।

source: Don't add sentences from copyrighted sources.
hi: कॉपीराईट वाले सोत्रों से वाक्य न जोड़ें।

source: We want natural-sounding translations, not word-for-word direct translations.
hi: हमे स्वाभाविक अनुवाद चाहिएँ, वैसे नहीं जिनमें शब्दों का केवल एक एक करके अनुवाद करा गया होता है।

source: Make a good translation of the sentence that you are translating. Don't let translations into other languages influence you.
hi: आप जिस वाक्य का अनुवाद कर रहे हैं, उस ही का अच्छी तरह से अनुवाद करें। दूसरी भाषाओं के अनुवादों से प्रभावित न होने दें।

source: Don't add annotations.
hi: पार्श्व-टिप्पणियाँ न जोड़ें।

source: Who are these people?
hi: ये लोग कौन है?

source: Ten, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, hundred.
hi: दस, बीस, तीस, चालीस, पचास, साठ, सत्तर, अस्सी, नब्बे, सौ।

source: Get lost!
hi: दफ़ा हो जा!

source: I was going out.
hi: मैं बाहर जा रहा था।

source: Correct!
hi: सही!

source: Chapeau!
hi: टोपी!

source: We agree.
hi: हम सहमत हैं।

source: Jump.
hi: उछलो.

source: The black dog ran.
hi: काला कुत्ता दौड़ा।

source: Would you please explain the rules to me?
hi: आप मुझे नियम समझा सकते हैं क्या?

source: I'm going to go give my shoes to the cobbler.
hi: मैं जूतों को मोची को देने जा रहा हूँ।

source: He likes not only music but sports as well.
hi: संगीत के अलावा उसे खेल भी पसंद है।

source: Ten, twenty, thirty, forty, fifty, sixty, seventy, eighty, ninety, one hundred.
hi: दस, बीस, तीस, चालीस, पचास, साठ, सत्तर, अस्सी, नब्बे, सौ।

source: They say that Firefox is downloaded more than 8 million times a day.
hi: कहते हैं के फ़ायरफ़ॉक्स प्रतिदिन ८ मिलियन से ज़्यादा बार डाउनलोड किया जाता है।

source: My name is Hase.
hi: मेरा नाम हासे है।

source: They can understand me.
hi: वे मुझे समझ सकते हैं।

source: My eye has swollen up.
hi: मेरी आँख सूज गई है।

source: My foot is aching.
hi: मुझे पैर में दर्द हो रहा है।

source: My leg is aching.
hi: मुझे पैर में दर्द हो रहा है।

source: Straighten your back!
hi: अपनी पीठ सीधी करो!

source: Don't make faces.
hi: मूँह मत बनाओ।

source: I'm going to the village tomorrow.
hi: मैं कल गाँव जा रहा हूँ।

source: Darn!
hi: लानत करना.

source: Bye!
hi: बाय!

source: I know your language.
hi: मुझे तुम्हारी भाषा आती है।

source: Look at that girl!
hi: उस लड़की को तो देखो!

source: I'm a little crazy.
hi: मैं थोड़ा पागल हूँ।

source: I am Japanese.
hi: मैं जापानी हूँ।

source: I love to eat yakitori.
hi: मुझे याकितोरी खाना बहुत पसंद है।

source: Do not feed the troll.
hi: ट्रोल को मत खिलाओ।

source: One hundred, two hundred, three hundred, four hundred, five hundred, six hundred, seven hundred, eight hundred, nine hundred, one thousand.
hi: एक सौ, दो सौ, तीन सौ, चार सौ, पांच सौ, छह सौ, सात सौ, आठ सौ, नौ सौ, एक हजार।

source: Iron is more useful than gold.
hi: लोहा सोने से ज़्यादा उपयोगी होता है।

source: In Africa there are many lions.
hi: आफ़्रिका में कई शेर हैं।

source: There are four seasons in this country.
hi: इस देश में चार मौसम हैं।

source: You run.
hi: तू भागता है।

source: No! Did he really say that? You can't be serious!
hi: हँ! उसने सच में ऐसा कहा क्या? ऐसा कैसे हो सकता है!

source: This dog is yours. Where is mine?
hi: यह कुत्ता तुम्हारा है। मेरा कहाँ है?

source: These are the people who saw the explosion.
hi: ये वे लोग है जिन्होंने वह विस्फोट देखा।

source: Hark!
hi: सुनो!

source: This is my friend.
hi: यह मेरा दोस्त है।

source: They're able to sing.
hi: उन्हें गाना आता है।

source: They lifted her above their heads.
hi: उन्होंने अपने सिर उठाएं।

source: Tom is an activist in his community.
hi: टॉम अपने समाज में कार्यकर्ता है।

source: Brad Pitt is an actor.
hi: ब्रैड पिट अभिनेता हैं।

source: Mary's doctor advised her to exercise.
hi: मैरी के डाक्टर ने उसे व्यायाम करने की सलाह दी।

source: Some people are afraid of spiders.
hi: कुछ लोग मकड़ीयों से डरते हैं।

source: I didn't hear it.
hi: मुझे सुनाई नहीं दिया।

source: Tom works for the Environmental Protection Agency.
hi: टॉम पर्यावरण संरक्षण एजेंसी के लिये काम करता है।

source: Many countries depend on agriculture.
hi: कई देश कृषि पर निर्भर करते हैं।

source: Agriculture is an important industry in California.
hi: कैलिफोर्निया में कृषि एक महत्त्वपूर्ण उद्योग है।

source: The balloon is filled with air.
hi: गुब्बारे में हवा भरी है।

source: Tom always wanted to join the air force.
hi: टॉम को हमेशा से ही वायु सेना में भरती होना था।

source: This is Carrie Underwood's latest album.
hi: यह कैरी अंडरवूड का सबसे नया अलबम है।

source: I finished all my work early.
hi: मैंने अपना सारा काम जल्दी ख़तम कर दिया।

source: Mary spent all her time working.
hi: मैरी ने अपना पूरा वक़्त काम करने में बिता दिया।

source: Tom was alone on Friday night.
hi: टॉम शुक्रवार की रात अकेला था।

source: The factory produces ammunition.
hi: वह कारखाना गोलाबारूद उत्पादित करता है।

source: Do you like ancient history?
hi: क्या तुम्हें प्राचीन इतिहास पसंद है?

source: Anger is hard to control.
hi: क्रोध पर नियंत्रण पाना मुश्किल होता है।

source: What's your answer?
hi: तुम्हारा जवाब क्या है?

source: They appointed a judge.
hi: उन्होंने एक न्यायाधीश नियुक्त किया।

source: What area of China do you like the best?
hi: तुम्हें चीन का कौनसा इलाक़ा सबसे ज़्यादा पसंद आया?

source: My neighbor was arrested last night.
hi: मेरे पड़ोसी को पिछली रात गिरफ़्तार किया गया।

source: They arrived in New Delhi on July 9th.
hi: वे ९ जुलाई को नयी दिल्ली पहुँचें।

source: The white ball weighs as much as the red ball.
hi: सफ़ेद गेंद का वज़न लाल गेंद जितना ही है।

source: Neil Armstrong was the first astronaut to walk on the moon.
hi: नील आर्मस्ट्रांग चांद पर चलने वाला पहला अंतरिक्ष यात्री था।

source: Atoms are in everything.
hi: परमाणु सभी में होते हैं।

source: Who first split the atom?
hi: परमाणु को सबसे पहली बार विभाजित किसने किया?

source: There was an attack on a worker last night.
hi: कल रात एक मज़दूर पर हमला हुआ था।

source: The soldiers started their attack.
hi: सैनिकों ने अपना हमला शुरू किया।

source: Twenty people attended the party.
hi: बीस लोग पार्टी में हाजिर थे।

source: Tom has a very old automobile.
hi: टॉम के पास एक बहुत पुरानी मोटर है।

source: We live ten minutes away from him.
hi: हम उससे दस मिनट दूर रहते हैं।

source: Tom put his money in the bank.
hi: टॉम ने अपने पैसे बैंक में डाल दिये।

source: Do you keep your money in a bank?
hi: क्या आप अपने पैसे बैंक में रखते हैं?

source: There are many examples of beauty.
hi: सुंदरता के कई उदाहरण होते हैं।

source: We have space for two beds.
hi: हमारे पास दो बिस्तरों के लिये जगह है।

source: There is a border between America and Mexico.
hi: अमरीका और मेक्सिको के बीच एक सीमा है।

source: They were born in Thailand.
hi: वे थाइलैंड में जन्मे थे।

source: Sixty-five countries boycotted the 1980 summer Olympics.
hi: पैंसठ देशों ने १९८० ग्रीष्मकालीन ओलंपिक खेलों का बहिष्कार किया।

source: The human brain weighs about three pounds.
hi: इनसानी दिमाग का वज़न लग-भग तीन पाउंड होता है।

source: Someone broke the window.
hi: किसी ने खिड़की तोड़ी।

source: People normally breathe 12 to 20 times a minute.
hi: लोग आमतौर पर 12 से 20 प्रति मिनट श्वास लेते हैं.

source: The bridge between Denmark and Sweden is almost five miles long.
hi: डेनमार्क और स्वीडन के बीच का पुल लग-भग पाँच मैल लंबा है।

source: They built the first electric car.
hi: उन्होंने पहली विद्युत कार निर्माण की।

source: It took 22 years to build the Taj Mahal.
hi: ताज महाल बनाने में २२ साल लगे।

source: It will burn.
hi: जलेगा।

source: The balloon will burst.
hi: वह गुब्बारा फट जाएगा।

source: They buried her dead husband.
hi: उन्होंने उसके मरे हुए पति को दफनाया।

source: She's burying her money in the sand.
hi: वह अपना पैसा रेत में दफना रही है।

source: They bought a car.
hi: उन्होंने एक गाड़ी खरीदी।

source: The family wants to buy a house.
hi: वह परिवार एक घर खरीदना चाहता है।

source: Mary wants to buy a dress.
hi: मैरी एक ड्रेस खरीदना चाहती है।

source: Tom's mother and sister had breast cancer.
hi: टॉम के माँ और बहन को स्तन कैंसर हुआ था।

source: Tom caught the ball.
hi: टॉम ने गेंद पकड़ी।

source: They want to change the law.
hi: वह कानून बदलना चाहते हैं।

source: Nature is changing.
hi: प्रकृति बदल रही है।

source: He's a citizen of China.
hi: वह चीन का नागरिक है।

source: Tom wants to become a citizen.
hi: टॉम नागरिक बनना चाहता है।

source: Tom is a citizen of the United States.
hi: टॉम यूनाइटेड स्टेट्‍स का नागरिक है।

source: Malibu is on the coast of Southern California.
hi: मालिबू दक्षिणी कॅलिफॉर्निया के समुद्र-तट पर है।

source: Tom collected old coins.
hi: टॉम पुराने सिक्के इकट्ठा करता था।

source: What's the most famous college in the world?
hi: दुनिया का सबसे मशहूर कॉलेज कौन सा है?

source: We live in a global community.
hi: हम एक जागतिक समाज में रहते हैं।

source: A computer's electronics are very complex.
hi: कंप्यूटर के इलेक्ट्रानिक्स बहुत जटिल होते हैं।

source: I'll do it, but there's one condition.
hi: करूँगा, मगर एक शर्त पर।

source: Connect the two cables together.
hi: उन दो केबलों को एक-साथ जोड़िए।

source: They consider him their best employee.
hi: वे उसे उनका सबसे अच्छा कर्मचारी मानते हैं।

source: They contacted their local politicians.
hi: उन्होंने अपने स्थानिक नेताओं से संपर्क किया।

source: This cake contains flour, milk, eggs and sugar.
hi: इस केक में आटा, दूध, अंडे और शक्कर है।

source: Copy this program on your computer.
hi: इस प्रोग्राम को अपने कंप्यूटर पर कॉपी कर लेना।

source: This bride is covering her face with a veil.
hi: यह दुल्हन अपना चेहरा एक परदे से छिपा रही है।

source: The motorcycle crashed into a car.
hi: मोटरसाइकिल गाड़ी से टकराई।

source: The cars crashed into each other.
hi: गाडीयाँ एक दुसरे से टकराई।

source: James Cameron created a new way to make movies.
hi: जेम्स कैमेरन ने फ़िल्में बनाने का एक नया तरीका निर्माण किया।
